Tekla Open API Reference for Tekla Structures 2025
IGeometryNodeVisitor.Visit Method
Overload List
Name | Description
Visit(SpiralNode)
 Visits a node that is an instance of HelixNode
Visit(CylindricalSurfaceNode)
 Visits a node that is an instance of CylindricalSurfaceNode
Visit(PolygonNode)
 Visits a node that is an instance of PolygonNode node
Top
See Also
Reference
IGeometryNodeVisitor Interface
Tekla.Structures.Model Namespace